results/isolation_test/phase_3_run_2_raw.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 877.68 qps: 17558.35 (r/w/o: 12291.65/3510.93/1755.76) lat (ms,99%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 864.02 qps: 17276.12 (r/w/o: 12092.33/3455.86/1727.93) lat (ms,99%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 881.01 qps: 17624.10 (r/w/o: 12337.91/3524.06/1762.13) lat (ms,99%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 885.28 qps: 17706.95 (r/w/o: 12394.76/3541.63/1770.57) lat (ms,99%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 795.11 qps: 15902.01 (r/w/o: 11131.67/3180.12/1590.21) lat (ms,99%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 906.61 qps: 18132.92 (r/w/o: 12692.76/3626.94/1813.22) lat (ms,99%): 6.55 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            729428
        write:                           208408
        other:                           104204
        total:                           1042040
    transactions:                        52102  (868.30 per sec.)
    queries:                             1042040 (17366.02 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0035s
    total number of events:              52102

Latency (ms):
         min:                                    2.77
         avg:                                    4.60
         max:                                   17.67
         99th percentile:                        8.90
         sum:                               239701.04

Threads fairness:
    events (avg/stddev):           13025.5000/27.95
    execution time (avg/stddev):   59.9253/0.00