results/isolation_test/phase_3_run_4_raw.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 803.70 qps: 16076.40 (r/w/o: 11253.80/3214.80/1607.80) lat (ms,99%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 711.22 qps: 14226.30 (r/w/o: 9958.98/2844.88/1422.44) lat (ms,99%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 834.99 qps: 16701.13 (r/w/o: 11690.78/3340.37/1669.98) lat (ms,99%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 852.61 qps: 17052.52 (r/w/o: 11936.49/3410.82/1705.21) lat (ms,99%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 834.60 qps: 16690.43 (r/w/o: 11683.32/3338.01/1669.10) lat (ms,99%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 705.79 qps: 14117.35 (r/w/o: 9882.80/2822.87/1411.69) lat (ms,99%): 12.30 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            664076
        write:                           189736
        other:                           94868
        total:                           948680
    transactions:                        47434  (790.51 per sec.)
    queries:                             948680 (15810.21 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0034s
    total number of events:              47434

Latency (ms):
         min:                                    2.78
         avg:                                    5.05
         max:                                   30.62
         99th percentile:                       10.84
         sum:                               239717.12

Threads fairness:
    events (avg/stddev):           11858.5000/104.22
    execution time (avg/stddev):   59.9293/0.00