results/isolation_test/phase_4_run_1_raw.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 867.79 qps: 17360.58 (r/w/o: 12153.45/3471.16/1735.98) lat (ms,99%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 824.42 qps: 16487.97 (r/w/o: 11541.53/3297.69/1648.75) lat (ms,99%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 857.60 qps: 17152.82 (r/w/o: 12006.71/3430.80/1715.30) lat (ms,99%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 894.59 qps: 17891.63 (r/w/o: 12524.48/3577.97/1789.18) lat (ms,99%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 897.41 qps: 17949.53 (r/w/o: 12564.59/3590.13/1794.81) lat (ms,99%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 805.58 qps: 16108.48 (r/w/o: 11275.37/3222.04/1611.07) lat (ms,99%): 10.46 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            720692
        write:                           205912
        other:                           102956
        total:                           1029560
    transactions:                        51478  (857.89 per sec.)
    queries:                             1029560 (17157.71 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0048s
    total number of events:              51478

Latency (ms):
         min:                                    2.81
         avg:                                    4.66
         max:                                   19.15
         99th percentile:                        9.56
         sum:                               239703.41

Threads fairness:
    events (avg/stddev):           12869.5000/37.29
    execution time (avg/stddev):   59.9259/0.00