results/isolation_test/phase_4_run_3_raw.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 903.77 qps: 18079.30 (r/w/o: 12656.28/3615.08/1807.94) lat (ms,99%): 6.21 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 847.04 qps: 16941.85 (r/w/o: 11859.63/3388.15/1694.08) lat (ms,99%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 895.60 qps: 17912.70 (r/w/o: 12538.70/3582.80/1791.20) lat (ms,99%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 867.00 qps: 17338.47 (r/w/o: 12136.65/3467.81/1734.01) lat (ms,99%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 907.11 qps: 18142.30 (r/w/o: 12699.34/3628.74/1814.22) lat (ms,99%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 822.57 qps: 16450.63 (r/w/o: 11515.53/3289.97/1645.13) lat (ms,99%): 10.27 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            734104
        write:                           209744
        other:                           104872
        total:                           1048720
    transactions:                        52436  (873.84 per sec.)
    queries:                             1048720 (17476.79 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0056s
    total number of events:              52436

Latency (ms):
         min:                                    2.82
         avg:                                    4.57
         max:                                   24.08
         99th percentile:                        8.90
         sum:                               239704.02

Threads fairness:
    events (avg/stddev):           13109.0000/124.91
    execution time (avg/stddev):   59.9260/0.00